src/Documents/ОпределениеФинансовыхРезультатов/ОпределениеФинансовыхРезультатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОпределениеФинансовыхРезультатов</name>
  <comment>(Регл)</comment>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьПрибыльУбыток</name>
    <comment>Расчет прибыли (убытка) в конце года с формированием сальдо на 44 счете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрыватьДоходыИРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДополнительный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Documents/ОпределениеФинансовыхРезультатов/ObjectModule.bsl
Перем мУдалятьДвижения;

Перем мКонДата;
Перем мКонГраница;
Перем мПроводкиБУ;


//Процедура заполнения выполняемых действий при создании нового документа
Процедура ЗаполнитьВыполняемыеДействия() Экспорт
	РассчитыватьПрибыльУбыток = Истина;
	ЗакрыватьДоходыИРасходы   = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Возвращает массив со счетами финансовых результатов
//
// Возвращаемое значение:
//   Массив 
//
Функция ПолучитьМассивСчетовФинансовыхРезультатов()

	МассивСчетов = Новый Массив;
	
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РезультатДругойОбычнойДеятельности);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РезультатФинансовыхОпераций);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РезультатЧрезвычайныхСобытий);
	
	Возврат МассивСчетов;
	
КонецФункции // ПолучитьМассивСчетовФинансовыхРезультатов()
 
// Формирует соответствие счетов доходов (расходов) субсчетам финансовых результатов.
//
// Возвращаемое значение:
//   Соответствие, в котором ключом является счет доходов (расходов), а значением счет финансового результата.
//
Функция ПолучитьСоответствиеСчетов()

	// Операционная деятельность
	СоответствиеСчетов = Новый Соответствие;
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДоходыОтРеализации, 		ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругойОперационныйДоход, 	ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.МатериальныеЗатраты, 		ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда, 		ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия, 	
																					ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.Амортизация, 				ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты, ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.СебестоимостьРеализации, 	ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы,	ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.РасходыНаСбыт, 			ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа, 
																					ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.НалогНаПрибыльОтОбычнойДеятельности,
																					ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементамНалогНаПрибыль,
																					ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности);
	
	// Финансовая деятельность
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДоходОтУчастияВКапитале,	ПланыСчетов.Хозрасчетный.РезультатФинансовыхОпераций);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ПрочиеФинансовыеДоходы,	ПланыСчетов.Хозрасчетный.РезультатФинансовыхОпераций);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ФинансовыеЗатраты,			ПланыСчетов.Хозрасчетный.РезультатФинансовыхОпераций);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ПотериОтУчастияВКапитале,	ПланыСчетов.Хозрасчетный.РезультатФинансовыхОпераций);
	
	// Другая обычная деятельность
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеДоходы,				ПланыСчетов.Хозрасчетный.РезультатДругойОбычнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам,	ПланыСчетов.Хозрасчетный.РезультатДругойОбычнойДеятельности);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыДеятельности,	ПланыСчетов.Хозрасчетный.РезультатДругойОбычнойДеятельности);
	
	// Чрезвычайная деятельность
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ЧрезвычайныеДоходы,		ПланыСчетов.Хозрасчетный.РезультатЧрезвычайныхСобытий);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ЧрезвычайныеЗатраты,		ПланыСчетов.Хозрасчетный.РезультатЧрезвычайныхСобытий);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементамЧрезвычайныеЗатраты,
																					ПланыСчетов.Хозрасчетный.РезультатЧрезвычайныхСобытий);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементамЧрезвычайныеЗатраты,
																					ПланыСчетов.Хозрасчетный.РезультатЧрезвычайныхСобытий);
	СоответствиеСчетов.Вставить(ПланыСчетов.Хозрасчетный.НалогНаПрибыльОтЧрезвычайныхСобытий,
																					ПланыСчетов.Хозрасчетный.РезультатЧрезвычайныхСобытий);
	
	// Всем подчиненным счетам установим такое же соответствие.
	МассивСчетов = Новый Массив;
	Для каждого Элемент Из СоответствиеСчетов Цикл
		МассивСчетов.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Ссылка,
	               |	Хозрасчетный.Код КАК Код,
	               |	Хозрасчетный.Родитель
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |
	               |ГДЕ
	               |	Хозрасчетный.Ссылка В ИЕРАРХИИ(&МассивСчетов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Хозрасчетный.Ссылка.Код
	               |
	               |ИТОГИ КОЛИЧЕСТВО(Код) ПО
	               |	Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	ВыборкаПодчиненных = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодчиненных.Следующий() Цикл
	
		Если СоответствиеСчетов[ВыборкаПодчиненных.Ссылка] = Неопределено 
			И СоответствиеСчетов[ВыборкаПодчиненных.Родитель] <> Неопределено Тогда
		
			СоответствиеСчетов.Вставить(ВыборкаПодчиненных.Ссылка, СоответствиеСчетов[ВыборкаПодчиненных.Родитель]);
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат СоответствиеСчетов;

КонецФункции // ПолучитьСоответствиеСчетов()

// Устанавливает значение субконто в проводке по счету-назначению, если на нем есть такой же вид 
//  субконто, как и на счете-источнике.
//
// Параметры
//  СчетИсточника		– ПланСчетовСсылка – счет, откуда берется информация о субконто
//  СчетНазначение		– ПланСчетовСсылка – счет, по которому формируется проводка
//  ПроводкаСубконто	– РегистрБухгалтерииСубконто – коллекция субконто в проводке
//  НомерСубконтоИсточника - Число - номер субконто по счету источника, значение которого передается
//  ЗначениеСубконто 	- Произвольный - значение субконто для установки в проводку
//
Процедура УстановитьСовпадающееПоВидуСубконто(СчетИсточник, СчетНазначение, ПроводкаСубконто, НомерСубконтоИсточника, ЗначениеСубконто)

	Если ЗначениеСубконто = NULL Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НомерСубконтоИсточника > СчетИсточник.ВидыСубконто.Количество() Тогда
			
		Возврат;
			
	КонецЕсли;
	
	ВидСубконто = СчетИсточник.ВидыСубконто[НомерСубконтоИсточника - 1].ВидСубконто;
	
	Если СчетНазначение.ВидыСубконто.Найти(ВидСубконто) <> Неопределено Тогда
	
		ПроводкаСубконто.Вставить(ВидСубконто, ЗначениеСубконто);
	
	КонецЕсли;

КонецПроцедуры // УстановитьСовпадающееПоВидуСубконто()

// ////////////////////////////////////////////////////////////////////////////////
// // ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("Организация, ПериодРегистрации");

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет настройки субконто на счетах, которые требуются для правильной работы алгоритма
//
// Параметры
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьНастройкиСубконто(Отказ, Заголовок)

	// Проверяем счета финансовых результатов
	
	МассивСчетовФинРез = ПолучитьМассивСчетовФинансовыхРезультатов();
	
	Для каждого СчетФинРез Из МассивСчетовФинРез Цикл
	
		Для каждого ВидСубконтоСтрока Из СчетФинРез.ВидыСубконто Цикл
		
			Если НЕ ВидСубконтоСтрока.ТолькоОбороты Тогда
			
				ОбщегоНазначения.СообщитьОбОшибке("На счетах финансовых результатов допускается аналитический учет только по оборотам (проверьте счет "+СчетФинРез+", вид субконто """+ВидСубконтоСтрока.ВидСубконто+""")!", Отказ, Заголовок);
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЦикла; 

КонецПроцедуры // ПроверитьНастройкиСубконто()
 

// Выполняет движения по регистрам 
//
Процедура ЗакрытиеДоходовИРасходов(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ЗакрыватьДоходыИРасходы Тогда
		Возврат;
	КонецЕсли;
	
	// Закрываем счета неоперационных расходов на счет финансового результата.
	// (Операционные расходы закрываются при расчете себестоимости).
	
	// Составим соответствие счетов доходов (расходов) субсчетам финансовых результатов.
	СоответствиеСчетов = ПолучитьСоответствиеСчетов();
	
	// Определим остатки на счетах доходов и расходов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.Счет КАК Счет,
	               |	ХозрасчетныйОстатки.Счет.Вид КАК ВидСчета,
	               |	ХозрасчетныйОстатки.Счет.Код КАК КодСчета,
	               |	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	               |	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ХозрасчетныйОстатки.НалоговоеНазначение,
	               |	ХозрасчетныйОстатки.СуммаНУОстаток,
	               |	ВЫБОР КОГДА ХозрасчетныйОстатки.Счет В ИЕРАРХИИ (&СчетаДоходов) ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ПризнакРасход
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецМесяца, Счет В (&МассивСчетов), , Организация = &Организация) КАК ХозрасчетныйОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КодСчета";
				   
	Запрос.УстановитьПараметр("КонецМесяца", мКонГраница);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("СчетаДоходов", ПланыСчетов.Хозрасчетный.ДоходыИРезультатыДеятельности);
	
	МассивСчетов = Новый Массив;
	Для каждого Элемент Из СоответствиеСчетов Цикл
		МассивСчетов.Добавить(Элемент.Ключ);
	КонецЦикла; 
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	ВыборкаОстатков = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаОстатков.Следующий() Цикл
		
		СчетФинансовыхРезультатов = СоответствиеСчетов[ВыборкаОстатков.Счет];
		Если СчетФинансовыхРезультатов = Неопределено Тогда
		
			ОбщегоНазначения.СообщитьИнформацию("Для счета " + ВыборкаОстатков.КодСчета + " не определен счет финансовых результатов! Остаток на счете не закрыт.", Заголовок, СтатусСообщения.Важное);
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаОстатков.СуммаОстаток = 0 И ВыборкаОстатков.СуммаНУОстаток = 0 Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Если ВыборкаОстатков.ВидСчета = ВидСчета.Активный Тогда
			
			Проводка = мПроводкиБУ.Добавить();
			Проводка.Период                    = мКонДата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетДт                    = СчетФинансовыхРезультатов;
			// Стараемся "передать" информацию о субконто из доходов (расходов) в фин. рез-ты
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетДт, Проводка.СубконтоДт, 1, ВыборкаОстатков.Субконто1);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетДт, Проводка.СубконтоДт, 2, ВыборкаОстатков.Субконто2);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетДт, Проводка.СубконтоДт, 3, ВыборкаОстатков.Субконто3);
			
			Проводка.СчетКт                    = ВыборкаОстатков.Счет;
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетКт, Проводка.СубконтоКт, 1, ВыборкаОстатков.Субконто1);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаОстатков.Субконто2);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетКт, Проводка.СубконтоКт, 3, ВыборкаОстатков.Субконто3);
			
			Проводка.Сумма                     = ВыборкаОстатков.СуммаОстаток;
			Проводка.Содержание                = "Финансовые результаты: закрытие расходов";
			Проводка.НомерЖурнала              = "ФР";
			
			Если Проводка.СчетДт.НалоговыйУчет Тогда
				Проводка.НалоговоеНазначениеДт	   = ВыборкаОстатков.НалоговоеНазначение;
				Проводка.СуммаНУДт                 = ВыборкаОстатков.СуммаНУОстаток;
			КонецЕсли;
			Если Проводка.СчетКт.НалоговыйУчет Тогда
				Проводка.НалоговоеНазначениеКт	   = ВыборкаОстатков.НалоговоеНазначение;
				Проводка.СуммаНУКт                 = ВыборкаОстатков.СуммаНУОстаток;
			КонецЕсли;
			
		Иначе
			
			Проводка = мПроводкиБУ.Добавить();
			Проводка.Период                    = мКонДата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетДт                    = ВыборкаОстатков.Счет;
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетДт, Проводка.СубконтоДт, 1, ВыборкаОстатков.Субконто1);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетДт, Проводка.СубконтоДт, 2, ВыборкаОстатков.Субконто2);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетДт, Проводка.СубконтоДт, 3, ВыборкаОстатков.Субконто3);
			
			Проводка.СчетКт                    = СчетФинансовыхРезультатов;
			// Стараемся "передать" информацию о субконто из доходов (расходов) в фин. рез-ты
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетКт, Проводка.СубконтоКт, 1, ВыборкаОстатков.Субконто1);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаОстатков.Субконто2);
			УстановитьСовпадающееПоВидуСубконто(ВыборкаОстатков.Счет, Проводка.СчетКт, Проводка.СубконтоКт, 3, ВыборкаОстатков.Субконто3);
			
			Проводка.Сумма                     = - ВыборкаОстатков.СуммаОстаток;
			Проводка.Содержание                = "Финансовые результаты: закрытие доходов";
			Проводка.НомерЖурнала              = "ФР";
			
			Если Проводка.СчетДт.НалоговыйУчет Тогда
				Проводка.НалоговоеНазначениеДт	   = ВыборкаОстатков.НалоговоеНазначение;
				Проводка.СуммаНУДт                 = - ВыборкаОстатков.СуммаНУОстаток;
			КонецЕсли;
			Если Проводка.СчетКт.НалоговыйУчет Тогда
				Проводка.НалоговоеНазначениеКт	   = ВыборкаОстатков.НалоговоеНазначение;
				Проводка.СуммаНУКт                 = - ВыборкаОстатков.СуммаНУОстаток;
			КонецЕсли;
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	мПроводкиБУ.Записать(Ложь);

КонецПроцедуры

// Выполняет движения по регистрам 
//
Процедура РасчетПрибылиУбытка(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.РассчитыватьПрибыльУбыток Тогда
		Возврат;
	КонецЕсли;
	
	// Определим остатки на счетах финансовых результатов и использованной прибыли
	МассивСчетов = ПолучитьМассивСчетовФинансовыхРезультатов();
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрибыльИспользованнаяВОтчетномПериоде);
	
	СтруктураОтбора = Новый Структура("Счет, Организация", МассивСчетов, СтруктураШапкиДокумента.Организация);
	
	ТаблицаОстатков = РегистрыБухгалтерии.Хозрасчетный.Остатки(мКонГраница,,СтруктураОтбора,"Счет,НалоговоеНазначение","Сумма,СуммаНУ");
	
	ФинансовыйРезультат = ТаблицаОстатков.Итог("СуммаОстатокДт") - ТаблицаОстатков.Итог("СуммаОстатокКт");
	
	СчетПрибылиУбытка = Неопределено;
	Если ФинансовыйРезультат < 0 Тогда
		
		// Прибыль
		СчетПрибылиУбытка = ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыль;
		
	Иначе
		
		// Убыток
		СчетПрибылиУбытка = ПланыСчетов.Хозрасчетный.НепокрытыйУбыток;
		
	КонецЕсли;
	
	// Закрываем все остатки на счет прибыли (убытка)
	Для каждого СтрокаОстатка Из ТаблицаОстатков Цикл
		
		Остаток = СтрокаОстатка.СуммаОстатокДт - СтрокаОстатка.СуммаОстатокКт;
		ОстатокНУ = СтрокаОстатка.СуммаНУОстатокДт - СтрокаОстатка.СуммаНУОстатокКт;
		
		Если Остаток > 0 Тогда
		
			Проводка = мПроводкиБУ.Добавить();
			Проводка.Период                    = мКонДата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			Проводка.СчетДт                    = СчетПрибылиУбытка;
			Проводка.СчетКт                    = СтрокаОстатка.Счет;
			Проводка.Сумма                     = Остаток;
			Проводка.Содержание                = "Финансовые результаты: формирование прибыли/убытка";
			Проводка.НомерЖурнала              = "ФР";
			
			Если Проводка.СчетКт.НалоговыйУчет Тогда
				Проводка.НалоговоеНазначениеКт	   = СтрокаОстатка.НалоговоеНазначение;
				Проводка.СуммаНУКт                 = ОстатокНУ;
			КонецЕсли;
			
		Иначе
			
			Проводка = мПроводкиБУ.Добавить();
			Проводка.Период                    = мКонДата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			Проводка.СчетДт                    = СтрокаОстатка.Счет;
			Проводка.СчетКт                    = СчетПрибылиУбытка;
			Проводка.Сумма                     = -Остаток;
			Проводка.Содержание                = "Финансовые результаты: формирование прибыли/убытка";
			Проводка.НомерЖурнала              = "ФР";
			
			Если Проводка.СчетДт.НалоговыйУчет Тогда
				Проводка.НалоговоеНазначениеДт	   = СтрокаОстатка.НалоговоеНазначение;
				Проводка.СуммаНУДт                 = -ОстатокНУ;
			КонецЕсли;
		
		КонецЕсли; 
	
	КонецЦикла; 

	мПроводкиБУ.Записать(Ложь);

КонецПроцедуры

// Выполняет движения по регистрам 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если СтруктураШапкиДокумента.ЗакрыватьДоходыИРасходы Тогда
		
		ЗакрытиеДоходовИРасходов(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;

	Если СтруктураШапкиДокумента.РассчитыватьПрибыльУбыток Тогда
		
		РасчетПрибылиУбытка(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

 	мКонДата    = КонецМесяца (ПериодРегистрации);
 	мКонГраница = Новый Граница(мКонДата, ВидГраницы.Включая);
 	мПроводкиБУ = Движения.Хозрасчетный;

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПроверитьНастройкиСубконто(Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью
